Table of Contents
 Class ConcreteCheckResultOverallItem
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Overal check item
public class ConcreteCheckResultOverallItem
Inheritance
object
ConcreteCheckResultOverallItem
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConcreteCheckResultOverallItem()
Constructor
public ConcreteCheckResultOverallItem()
Properties
 CheckValue
calculated limited value, calculated as strain to limit strain
public double CheckValue { get; set; }
Property Value
double
 Result
check result passed/failed
public CheckResult Result { get; set; }
Property Value
CheckResult
 ResultType
Check result type
public CheckResultType ResultType { get; set; }
Property Value
CheckResultType
 Edit this page